In [1]:
import pandas as pd
import numpy as np

In [2]:
frame1 = pd.DataFrame(np.arange(16).reshape((4,4)), index = ['red', 'blue', 'yellow', 'white'] , columns = ['ball', 'pen', 'pencil', 'paper'])
frame1

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

# DataType of all variables in the DataFrame

In [3]:
frame1.dtypes

ball      int32
pen       int32
pencil    int32
paper     int32
dtype: object

**Selection of variables of DataFrame based on the datatype**

In [4]:
frame1.dtypes.index

Index(['ball', 'pen', 'pencil', 'paper'], dtype='object')

# Summary - Describe

In [5]:
frame1.describe()

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

* It provides us 8 summary statistics ouf of the dataframe { mean, S.D, 3 quartiles , min & max , count}

**Summary statistics based on the datatype**

In [6]:
frame1["ball"] = frame1["ball"].astype(object)

In [7]:
frame1.dtypes

ball      object
pen        int32
pencil     int32
paper      int32
dtype: object

In [8]:
# below is the summary statistics of all variables excluding the variable "ball" which have "object" datatype 
# Hence, 8 summary statistics is provided only for the float or int data types variables
frame1.describe()

             pen     pencil      paper
count   4.000000   4.000000   4.000000
mean    7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978
min     1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000
50%     7.000000   8.000000   9.000000
75%    10.000000  11.000000  12.000000
max    13.000000  14.000000  15.000000

In [9]:
# below is the summary statistics of variables having "Object" datatype
# For the categorical data type the same 'describe' command provided 4 summary statistics 
frame1.describe(include = ['O'])

        ball
count      4
unique     4
top        0
freq       1

### Sorting

#### Sorting based on the index of the data frame

In [10]:
ser = pd.Series([5,0,3,8,4], index=['red', 'blue', 'yellow', 'white', 'green'])
ser

red       5
blue      0
yellow    3
white     8
green     4
dtype: int64

In [11]:
# By default it is ascending order
# Sorted the data in the dataframe based on the Index labels of the dataframe
ser.sort_index()

blue      0
green     4
red       5
white     8
yellow    3
dtype: int64

In [12]:
# Now sorting is done in descending order
ser.sort_index(ascending = False)

yellow    3
white     8
red       5
green     4
blue      0
dtype: int64

In [13]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)), index = ['red','blue','yellow','white'] , columns = ['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [14]:
# Sorting the dataframe based on the index 
frame.sort_index()

        ball  pen  pencil  paper
blue       4    5       6      7
red        0    1       2      3
white     12   13      14     15
yellow     8    9      10     11

In [15]:
frame.sort_index(ascending = False)

        ball  pen  pencil  paper
yellow     8    9      10     11
white     12   13      14     15
red        0    1       2      3
blue       4    5       6      7

#### Sorting based on the columns of the Data Frame

In [16]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [17]:
frame.sort_values(ascending = False , by= "pen")

        ball  pen  pencil  paper
white     12   13      14     15
yellow     8    9      10     11
blue       4    5       6      7
red        0    1       2      3

* sort_index: sorting based on index labels 
* sort_values : sorting based on columns

### Ranking

In [18]:
ser

red       5
blue      0
yellow    3
white     8
green     4
dtype: int64

In [19]:
# It assigns lowest rank to the lowest value and highest rank to the highest value
ser.rank()

red       4.0
blue      1.0
yellow    2.0
white     5.0
green     3.0
dtype: float64

In [20]:
series = pd.Series([1,2,2,3,4,4,4])
series

0    1
1    2
2    2
3    3
4    4
5    4
6    4
dtype: int64

In [21]:
series.rank(method = 'first')

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
dtype: float64

*  The method parameter specifies the method used to assign ranks to the values that have the same value.
*  if there are two or more values in the Series that have the same value, the rank is assigned based on their position in the Series. The first occurrence of the value in the Series gets the lowest rank, and the subsequent occurrences get higher rank

### Relationship between 2 series

In [23]:
ser1 = pd.Series([3,4,3,4,5,4,3,2],index =['2006','2007','2008','2009','2010','2011','2012','2013'])
ser2 = pd.Series([1,2,3,4,4,3,2,1], index = ['2006','2007','2008','2009','2010','2011','2012','2013'])

In [24]:
# Karl pearson Correlation coefficient between 2 series
ser1.corr(ser2)

0.7745966692414834

In [25]:
# Covariance between 2 series
ser1.cov(ser2)

0.8571428571428571

In [26]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [27]:
# Correlation among all the columns in the dataframe
frame.corr()

        ball  pen  pencil  paper
ball     1.0  1.0     1.0    1.0
pen      1.0  1.0     1.0    1.0
pencil   1.0  1.0     1.0    1.0
paper    1.0  1.0     1.0    1.0

In [28]:
# Correlation between 2 specific columns in the dataframe
frame['ball'].corr(frame['pen'])

1.0

In [30]:
frame[['ball' , 'pen']].corr()

      ball  pen
ball   1.0  1.0
pen    1.0  1.0

In [31]:
# 'axis' argument doesn't applies with 'corr'
frame.corr(axis=1)

TypeError: corr() got an unexpected keyword argument 'axis'

# Handelling null values in the DataFrame

In [32]:
import pandas as pd
import numpy as np

In [33]:
frame3 = pd.DataFrame([[6,np.nan,6] , [np.nan, np.nan, np.nan] , [2, np.nan, 5]], index = ['blue','green','red'], columns = ['ball', 'mug', 'pen'])
frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  NaN  NaN
red     2.0  NaN  5.0

## Drop Null values

In [34]:
# It removes all rows from the dataframe that includes atleast one null value
frame3.dropna()

Empty DataFrame
Columns: [ball, mug, pen]
Index: []

In [35]:
# It removes all those rows from the dataframe when all elements of the raw is null
frame3.dropna(how = 'all')

      ball  mug  pen
blue   6.0  NaN  6.0
red    2.0  NaN  5.0

In [36]:
# It removes those columns from the datafram which have atleast 50% missing values.
frame3.dropna(axis =1 , thresh = 0.5)

       ball  pen
blue    6.0  6.0
green   NaN  NaN
red     2.0  5.0

## Null value imputation

### Imputing null values in the entire dataframe

In [37]:
# Here we are imputing null values in the entire dataframe "frame3"
frame3.fillna(0.5)

       ball  mug  pen
blue    6.0  0.5  6.0
green   0.5  0.5  0.5
red     2.0  0.5  5.0

In [38]:
frame3.fillna(2)

       ball  mug  pen
blue    6.0  2.0  6.0
green   2.0  2.0  2.0
red     2.0  2.0  5.0

* The modified DataFrame contains 0 in the places where NaN values were present in the original DataFrame.
* The fillna() method returns a new DataFrame or Series with the NaN values replaced with the specified value

In [ ]:
frame3.fillna(2 , inplace = True)

* The 'inplace = True' parameter ensures that the change is permanent in the dataset

In [39]:
# Here we have passed a dictionary which specifies that how to fill missing value in the columns with specific values
frame3.fillna({'ball':1, 'mug':0, 'pen':99})

       ball  mug   pen
blue    6.0  0.0   6.0
green   1.0  0.0  99.0
red     2.0  0.0   5.0

### Imputing null values to a specific variable of the dataframe

In [ ]:
frame3

In [ ]:
frame3['mug'].fillna(3 , inplace = True)

In [ ]:
frame3

## Null value count

In [40]:
import pandas as pd

In [41]:
frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  NaN  NaN
red     2.0  NaN  5.0

In [42]:
# # it creates a dataframe with True/False values, where True: if that value is null, False: if that value is not null
frame3.isnull()

        ball   mug    pen
blue   False  True  False
green   True  True   True
red    False  True  False

In [43]:
frame4 = pd.DataFrame([[6,2,6] , [1, 2, 3] , [2, 4, 5]], index = ['blue','green','red'], columns = ['ball', 'mug', 'pen'])
frame4

       ball  mug  pen
blue      6    2    6
green     1    2    3
red       2    4    5

In [44]:
# Below is the pandas series
# It would provide sum total of all the numerical variables in the dataframe in the form of the series
frame4.sum()

ball     9
mug      8
pen     14
dtype: int64

In [45]:
# It provides the total number of null values in each variable of the dataframe
frame3.isnull().sum()

ball    1
mug     3
pen     1
dtype: int64

In [46]:
# Number of null values in each of the variable (or total numvber of rows with null values under each variable)
# 'axis=0' is by default value as well
frame3.isnull().sum(axis = 0)

ball    1
mug     3
pen     1
dtype: int64

In [47]:
# Number of null values in each row of the dataframe (or total numvber of columns with null values under each row)
frame3.isnull().sum(axis = 1)

blue     1
green    3
red      1
dtype: int64

In [48]:
# Here we have derived the percentage of null values for variables in the dataframe
frame3.isnull().sum() / frame3.shape[0]

ball    0.333333
mug     1.000000
pen     0.333333
dtype: float64

# Selection of Dataframe based on the datatypes

In [49]:
import pandas as pd
data_path = 'xxx'
data = pd.read_csv(data_path + "Real_Estate_Cleaned.csv")
data.head()

,index,sub_area,n_bhk,surface,price,company_name,township,club_house,school,hospital,mall,park,pool,gym
0,1,bavdhan,1.0,492.0,3.9,shapoorji paloonji,vanaha,yes,yes,yes,yes,yes,yes,yes
1,2,bavdhan,2.0,774.0,6.5,shapoorji paloonji,vanaha,yes,yes,yes,yes,yes,yes,yes
2,3,bavdhan,3.0,889.0,7.4,shapoorji paloonji,vanaha,yes,yes,yes,yes,yes,yes,yes
3,4,bavdhan,3.0,1018.0,8.9,shapoorji paloonji,vanaha,yes,yes,yes,yes,yes,yes,yes
4,5,mahalunge,2.0,743.0,7.4,godrej properties,godrej hills retreat,yes,yes,yes,yes,yes,yes,yes

In [50]:
data.dtypes

index             int64
sub_area         object
n_bhk           float64
surface         float64
price           float64
company_name     object
township         object
club_house       object
school           object
hospital         object
mall             object
park             object
pool             object
gym              object
dtype: object

In [51]:
# Here we only selected columns with "object" data types
data.select_dtypes(include = "object").head()

,sub_area,company_name,township,club_house,school,hospital,mall,park,pool,gym
0,bavdhan,shapoorji paloonji,vanaha,yes,yes,yes,yes,yes,yes,yes
1,bavdhan,shapoorji paloonji,vanaha,yes,yes,yes,yes,yes,yes,yes
2,bavdhan,shapoorji paloonji,vanaha,yes,yes,yes,yes,yes,yes,yes
3,bavdhan,shapoorji paloonji,vanaha,yes,yes,yes,yes,yes,yes,yes
4,mahalunge,godrej properties,godrej hills retreat,yes,yes,yes,yes,yes,yes,yes

In [52]:
# Here we only selected columns with "float" data types
data.select_dtypes(include = "float").head()

   n_bhk  surface  price
0    1.0    492.0    3.9
1    2.0    774.0    6.5
2    3.0    889.0    7.4
3    3.0   1018.0    8.9
4    2.0    743.0    7.4

In [53]:
data.select_dtypes(exclude = 'object').head()

   index  n_bhk  surface  price
0      1    1.0    492.0    3.9
1      2    2.0    774.0    6.5
2      3    3.0    889.0    7.4
3      4    3.0   1018.0    8.9
4      5    2.0    743.0    7.4